[
  {
    "title": "Inception",
    "episode_id": 4,
    "desc": "Cobb steals information from his targets by entering their dreams. Saito offers to wipe clean Cobb's criminal history as payment for performing an inception on his sick competitor's son.",
    "img": "https://m.media-amazon.com/images/M/MV5BMjAxMzY3NjcxNF5BMl5BanBnXkFtZTcwNTI5OTM0Mw@@._V1_SX300.jpg",
    "url": "https://swapi.dev/api/films/1/"
  },
  {
    "title": "The Empire Strikes Back",
    "episode_id": 5,
    "desc": "Han Hye-Ryool carries out her job as a prosecutor in an excellent manner, but people denigrate her work because of her family's prestigious background. She wants to break free from her family ties and satisfy her own desires. Meanwhile, her husband Na Geun-Woo has been mentioned as a possible presidential candidate. ",
    "img": "https://m.media-amazon.com/images/I/51rHfst51TL._AC_SY1000_.jpg",
    "url": "https://swapi.dev/api/films/2/"
  },
  {
    "title": "Return of the Jedi",
    "episode_id": 6,
    "desc": "Luke Skywalker attempts to bring his father back to the light side of the Force. At the same time, the rebels hatch a plan to destroy the second Death Star.",
    "img": "https://m.media-amazon.com/images/I/51xQHKh6wwL._AC_SY1000_.jpg",
    "url": "https://swapi.dev/api/films/3/"
  },
  {
    "title": "The Phantom Menace",
    "episode_id": 1,
    "desc": "Phantom, the 21st successor of Bangalla's resident superhero, faces struggle when he travels to New York in order to stop a madman from taking three magic skulls that will give him supreme power.",

    "img": "https://img-pttavm.mncdn.com/pimages/592/091/514/620b5ff7564bf.jpg?v=201910111528",
    "url": "https://swapi.dev/api/films/4/"
  },
  {
    "title": "Attack of the Clones",
    "episode_id": 2,
    "desc": "When man-eating Titans first appeared 100 years ago, humans found safety behind massive walls that stopped the giants in their tracks. But the safety they have had for so long is threatened when a colossal Titan smashes through the barriers",

    "img": "https://m.media-amazon.com/images/I/512K7WkyZKL._AC_SY1000_.jpg",
    "url": "https://swapi.dev/api/films/5/"
  },
  {
    "title": "Revenge of the Sith",
    "episode_id": 3,
    "desc": "Anakin joins forces with Obi-Wan and sets Palpatine free from the evil clutches of Count Doku. However, he falls prey to Palpatine and the Jedis' mind games and gives into temptation.",
    "img": "https://kbimages1-a.akamaihd.net/50a779f5-b8a1-4deb-b0ab-254083eb2df1/353/569/90/False/revenge-of-the-sith-star-wars-episode-iii.jpg",
    "url": "https://swapi.dev/api/films/6/"
  }
]
